// Завдання 1: Перевірка пароля - підрахунок цифр
// Програма аналізує пароль і рахує, скільки цифр у ньому міститься.
// Умови:
// 1. Створіть змінну password (рядок).
// 2. За допомогою циклу for:
// переберіть всі символи пароля;
// порахуйте кількість цифр (0-9).
// 3. Якщо цифр менше 2 - "Password is weak".
// 4. Якщо цифр 2 або більше - "Password is strong".
// Приклад вхідних даних:
// const password ="qaTest123";
// Очікуваний результат:
// Password is strong

// const password = 'lasasdasdd12123123123'
// let counter = 0

// for (let i = 0; i <= (password.length - 1); i++) {
//     for (a = 0; a <= 9; a++) {
//         if (a === Number(password[i])) {
//             counter += 1
//         }
//     }
// }
// if (counter >= 2) {
//     console.log('Password is strong')
// } else {
//     console.log('Password is weak')
// }

// Завдання 2: Генерація таблиці множення
// Умови:
// Створіть програму, яка генерує таблицю множення для обраного числа за допомогою кожного з циклів for, while .
// Виберіть число для якого потрібно згенерувати таблицю множення.
// Використовуючи цикл for, створіть таблицю множення для обраного числа від 1 до 10. Виведіть результат в консоль.
// Використовуючи цикл while створіть аналогічну таблицю множення та виведіть її в консоль.
// Приклад вхідних даних:
// const number = 5;
// Очікуваний результат:
// 5x 1 = 5
// 5x 2 = 10
// 5x 3 = 15
// 5x 4 = 20
// 5x 5 = 25
// 5x 6 = 30
// 5x 7 = 35
// 5x 8 = 40
// 5x 9 = 45
// 5x 10 = 50

let number = 4

// for (let i = 1; i <= 10; i++) {
//     console.log(`${number} x ${i} = ${number * i}`)
// }
let i = 1
while (i <= 10) {
    console.log(`${number} x ${i} = ${number * i}`)
    i++
}